Table of Contents
 Interface IIdeaPolyLine3D
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represents a polyline in three-dimensional space.
public interface IIdeaPolyLine3D : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Segments
Gets the segments contained by the polygon
List<IIdeaSegment3D> Segments { get; }
Property Value
List<IIdeaSegment3D>
 Edit this page